; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-89)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c2)
    (capacity v5 c1)
    (capacity v6 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l4)
    (at p2 l10)
    (at p3 l6)
    (at p4 l4)
    (at p5 l6)
    (at p6 l11)
    (at p7 l9)
    (at p8 l15)
    (at p9 l11)
    (at p10 l12)
    (at p11 l2)
    (at p12 l9)
    (at p13 l11)
    (at p14 l11)
    (at p15 l4)
    (at v1 l14)
    (at v2 l6)
    (at v3 l1)
    (at v4 l7)
    (at v5 l1)
    (at v6 l13)
    (road l14 l10)
    (road l5 l7)
    (road l5 l1)
    (road l3 l10)
    (road l14 l13)
    (road l9 l5)
    (road l8 l12)
    (road l10 l3)
    (road l9 l11)
    (road l2 l5)
    (road l2 l14)
    (road l13 l14)
    (road l15 l14)
    (road l4 l2)
    (road l12 l9)
    (road l5 l9)
    (road l14 l15)
    (road l2 l4)
    (road l10 l14)
    (road l1 l5)
    (road l14 l2)
    (road l12 l8)
    (road l5 l2)
    (road l9 l6)
    (road l9 l12)
    (road l11 l9)
    (road l7 l5)
    (road l6 l9)
    (road l8 l14)
    (road l14 l8)
    (road l1 l15)
    (road l15 l1)
    (road l1 l3)
    (road l3 l1)
    (road l4 l11)
    (road l11 l4)
    (road l6 l14)
    (road l14 l6)
    (road l2 l8)
    (road l8 l2)
    (road l11 l15)
    (road l15 l11)
    (road l9 l10)
    (road l10 l9)
    (road l11 l13)
    (road l13 l11)
    (road l1 l2)
    (road l2 l1)
    (road l3 l5)
    (road l5 l3)
    (road l7 l9)
    (road l9 l7)
    (road l9 l13)
    (road l13 l9)
    (road l3 l15)
    (road l15 l3)
    (road l5 l13)
    (road l13 l5)
    (road l5 l11)
    (road l11 l5)
    (road l12 l14)
    (road l14 l12)
    (road l6 l13)
    (road l13 l6)
    (road l2 l3)
    (road l3 l2)
    (road l3 l13)
    (road l13 l3)
    (road l12 l15)
    (road l15 l12)
    (road l7 l8)
    (road l8 l7)
    (road l7 l10)
    (road l10 l7)
    (road l7 l15)
    (road l15 l7)
    (road l2 l13)
    (road l13 l2)
    (road l1 l9)
    (road l9 l1)
    (road l8 l15)
    (road l15 l8)
    (road l5 l15)
    (road l15 l5)
    (road l1 l12)
    (road l12 l1)
    (road l10 l12)
    (road l12 l10)
    (road l6 l7)
    (road l7 l6)
    (road l7 l12)
    (road l12 l7)
    (road l1 l7)
    (road l7 l1)
    (road l8 l9)
    (road l9 l8)
    (road l4 l15)
    (road l15 l4)
    (road l2 l15)
    (road l15 l2)
    (road l4 l12)
    (road l12 l4)
    (road l1 l11)
    (road l11 l1)
    (road l3 l6)
    (road l6 l3)
    (road l2 l6)
    (road l6 l2)
    (road l4 l7)
    (road l7 l4)
    (road l1 l14)
    (road l14 l1)
    (road l6 l11)
    (road l11 l6)
    (road l5 l10)
    (road l10 l5)
    (road l13 l15)
    (road l15 l13)
    (road l5 l12)
    (road l12 l5)
    (road l9 l14)
    (road l14 l9)
    (road l9 l15)
    (road l15 l9)
    (road l6 l15)
    (road l15 l6)
    (road l10 l13)
    (road l13 l10)
    (road l1 l10)
    (road l10 l1)
    (road l4 l13)
    (road l13 l4)
    )
 (:goal (and 
(at p1 l15)
(at p2 l8)
(at p3 l15)
(at p4 l7)
))
)

; plan
1. (drive v6 l13 l10)
   deleted: (at v6 l13)
   added: (at v6 l10)
   goals met: 0 of 4
2. (pick-up v6 l10 p2 c1 c2)
   deleted: (at p2 l10) (capacity v6 c2)
   added: (in p2 v6) (capacity v6 c1)
   goals met: 0 of 4
3. (drive v6 l10 l12)
   deleted: (at v6 l10)
   added: (at v6 l12)
   goals met: 0 of 4
4. (drive v6 l12 l8)
   deleted: (at v6 l12)
   added: (at v6 l8)
   goals met: 0 of 4
5. (drop v6 l8 p2 c1 c2)
   deleted: (in p2 v6) (capacity v6 c1)
   added: (at p2 l8) (capacity v6 c2)
   goals met: 1 of 4
6. (drive v4 l7 l4)
   deleted: (at v4 l7)
   added: (at v4 l4)
   goals met: 1 of 4
7. (pick-up v4 l4 p1 c1 c2)
   deleted: (at p1 l4) (capacity v4 c2)
   added: (in p1 v4) (capacity v4 c1)
   goals met: 1 of 4
8. (pick-up v4 l4 p4 c0 c1)
   deleted: (at p4 l4) (capacity v4 c1)
   added: (in p4 v4) (capacity v4 c0)
   goals met: 1 of 4
9. (pick-up v2 l6 p3 c1 c2)
   deleted: (at p3 l6) (capacity v2 c2)
   added: (in p3 v2) (capacity v2 c1)
   goals met: 1 of 4
10. (drive v2 l6 l15)
   deleted: (at v2 l6)
   added: (at v2 l15)
   goals met: 1 of 4
11. (drop v2 l15 p3 c1 c2)
   deleted: (in p3 v2) (capacity v2 c1)
   added: (at p3 l15) (capacity v2 c2)
   goals met: 2 of 4
12. (drive v4 l4 l15)
   deleted: (at v4 l4)
   added: (at v4 l15)
   goals met: 2 of 4
13. (drop v4 l15 p1 c0 c1)
   deleted: (in p1 v4) (capacity v4 c0)
   added: (at p1 l15) (capacity v4 c1)
   goals met: 3 of 4
14. (drive v4 l15 l7)
   deleted: (at v4 l15)
   added: (at v4 l7)
   goals met: 3 of 4
15. (drop v4 l7 p4 c1 c2)
   deleted: (in p4 v4) (capacity v4 c1)
   added: (at p4 l7) (capacity v4 c2)
   goals met: 4 of 4
